<a href="https://colab.research.google.com/github/mehrdadkazemi254/MachineLearning/blob/main/Pandas_Creating_Reading_and_Writing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [8]:
pd.DataFrame({'column1':[0,1,2],
              'column2':['Mike','Sam','Mark'],
              'column3':['Canada','Brazil','Peru']
              })

   column1 column2 column3
0        0    Mike  Canada
1        1     Sam  Brazil
2        2    Mark    Peru

In [11]:
pd.DataFrame({'ID':['01','11','22'],
              'Name':['Mike','Sam','Mark'],
              'BirthPlace':['Canada','Brazil','Peru']},
             index = ['Row 0','Row 1','Row 2']
              )

       ID  Name BirthPlace
Row 0  01  Mike     Canada
Row 1  11   Sam     Brazil
Row 2  22  Mark       Peru

In [16]:
pd.Series([11,12,13,14], index=['id 1','id 2','id 3','id 4'], name='S1')

id 1    11
id 2    12
id 3    13
id 4    14
Name: S1, dtype: int64

In [19]:
data = pd.read_csv('/content/sample_data/california_housing_train.csv')
data.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [25]:
data = pd.read_csv('/content/sample_data/california_housing_train.csv', index_col=0)
data.head()

           latitude  housing_median_age  ...  median_income  median_house_value
longitude                                ...
-114.31       34.19                15.0  ...         1.4936             66900.0
-114.47       34.40                19.0  ...         1.8200             80100.0
-114.56       33.69                17.0  ...         1.6509             85700.0
-114.57       33.64                14.0  ...         3.1917             73400.0
-114.57       33.57                20.0  ...         1.9250             65500.0

[5 rows x 8 columns]